chapiapp/app/controllers/categories_controller.rb

    def create
        @category= Category.create(categories_params)
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Conciertos"], ["created_at", "2018-10-24 14:13:30.590490"], ["updated_at", "2018-10-24 14:13:30.590490"]]