chapiapp/app/controllers/places_controller.rb

INSERT INTO "places" ("name", "direction", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Locus"], ["direction", "Cl. 69 "], ["created_at", "2018-10-23 16:48:52.821621"], ["updated_at", "2018-10-23 16:48:52.821621"]]
---
    def create
         @place = Place.create(place_params)

SELECT "places".* FROM "places"
---
    def index
        places = Place.all