app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Conciertos"], ["created_at", "2018-10-24 14:13:30.590490"], ["updated_at", "2018-10-24 14:13:30.590490"]]
---
    def create
        @category= Category.create(categories_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_events
    category = Category.find(params[:id])