app/controllers/events_controller.rb

  def create
    @event = Event.create(event_params)
---
INSERT INTO "events" ("name", "date", "charge", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "La noche de los muertos"], ["date", "0201-10-08"], ["charge", 15000], ["place_id", 1], ["created_at", "2018-10-25 14:31:54.666444"], ["updated_at", "2018-10-25 14:31:54.666444"]]