app/controllers/places_controller.rb

INSERT INTO "places" ("name", "direction", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Locus"], ["direction", "Cl. 69 "], ["created_at", "2018-10-23 16:48:52.821621"], ["updated_at", "2018-10-23 16:48:52.821621"]]
---
  def create
    @place = Place.create(place_params)

SELECT "places".* FROM "places"
---
  def index
    places = Place.all

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "places" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["latitude", 2], ["longitude", 5], ["updated_at", "2018-10-25 22:55:57.454060"], ["id", 1]]
---
  def update
    place = Place.find(params[:id])
    place.update(place_params)

SELECT  "places".* FROM "places" WHERE "places"."latitude" = ? AND "places"."longitude" = ? LIMIT ?  [["latitude", 5], ["longitude", 6], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_place_location
    place = Place.find_by(latitude: params[:latitude], longitude: params[:longitude])
    event = Event.find(place.id)