app/controllers/users_controller.rb

    def create
        @user= User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Locus espacio creativo"], ["created_at", "2018-10-24 16:51:42.960217"], ["updated_at", "2018-10-24 16:51:42.960217"]]

    def find_categories
        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]